#include <stdio.h>
#include <locale.h>


#define DL 30        // max число символов в строке
struct name{
	char fm[DL];     // фамилия
	char im;         // имя
	char ot;         // отчество
};       
struct inform{
	name nm;          // сылка на стр-ру name
	char prof[DL];    // профессия
	int god;          // год рождения
	float okl;        // оклад
};      
// инициализация вложенных структур (массива структур)
int main()
{
	setlocale(LC_ALL, "Russian");
	// ниже приведены различные варианты инициализации 
	// структурной переменной rabotn
	inform rb = { "Сидоров", 'С', 'С', "профессия", 1995, 567.89 };
	//inform rb = { "Сидоров", 'С', 'С', "профессия", 1995};
	// и массива структур mas
	inform mas[5] = {  "Иванов", 'И', 'И', "профессия 1", 1990, 500.50,
	        	       "Петров", 'П', 'П', "профессия 2", 2000, 600.0
	                };
	//inform mas[5] = { { "Иванов", 'И', 'И', "профессия 1", 1990, 500.50 },
    //                  { "Петров", 'П', 'П', "профессия 2", 2000, 600.67 }
    //                };
	//inform mas[5] = { { "Иванов", 'И', 'И', "профессия 1", 1990 },
	//                  { "Петров", 'П', 'П', "профессия 2", 2000 }
	//                };
	//inform mas[5] = { { "Иванов", 'И', 'И', "профессия 1", 1990, 500.50 }, 
	//                  {},
	//                  { "Петров", 'П', 'П', "профессия 2", 2000, 600.67 }
    //                };
	printf("\nинформация 1 :");
	printf("\nФИО : %-10s%2c%2c", rb.nm.fm, rb.nm.im, rb.nm.ot);
	printf("%15s%5d%10.2f", rb.prof, rb.god, rb.okl);
	printf("\nинформация 2 :");
	for (int i = 0; i < 5; i++)
	{	printf("\nФИО : %-10s%2c%2c", mas[i].nm.fm, mas[i].nm.im, mas[i].nm.ot);
	    printf("%15s%5d%10.2f", mas[i].prof, mas[i].god, mas[i].okl);
    }
	puts("\n");
  return 0;
}

//--------------------------------------------------------------------------------

// демонстрация вложенных структур
//int main()
//{
//	setlocale(LC_ALL, "russian");
//	inform mas[4] = {"Иванов",'И','И',"конструктор",1989,15000.50,
//	                 "Петров", 'П', 'П', "оператор", 1987, 12350.50 };
//	inform *him;         // указатель на структуру  inform
//
//	printf("размер структуры inform: %X \n", sizeof(inform));
//	printf("1 адрес mas[0]: %u   mas[1]: %u \n", &mas[0], &mas[1]);
//	printf("2 адрес mas[0]: %X   mas[1]: %X \n", &mas[0], &mas[1]);
//	him = mas;        //him содержит адрес   mas[0]
//	printf("3 адрес   him : %X    him+1: %X \n", him, him+1);
//	printf("4 адрес mas[0]: %x   mas[1]: %x \n\n",him,him+1);
//
//	printf("him->okl = %.2f   (*him).okl = %.2f \n",him->okl,(*him).okl);
//	//  him++;          //him содержит адрес следующей стр-ры   mas[1]
//	(++him)->okl++;     // him->okl==12351.5
//	printf("him->okl = %.2f   (*him).okl = %.2f \n",him->okl,(*him).okl);
//	// him--;
//	printf("him->nm.fm = %.20s   (*him).nm.fm = %.20s \n", (him)->nm.fm, (*--him).nm.fm);
//					// в этом случае выполняется переход к mas[0]-----------┘
//					// затем вывод -------------------------------┘
//	return 0;
//}


